In [1]:
import pandas as pd
import numpy as np

In [2]:
area = pd.Series({'Alaska': 1723337,
                 'Texas': 695662,
                 'California': 423967,
                 }, name='area')

population = pd.Series({
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127
}, name='population')

In [3]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [4]:
population.index | area.index

/tmp/ipykernel_7900/3714857733.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  population.index | area.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [5]:
population.index.union(area.index)

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [6]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [9]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [11]:
rng = np.random.RandomState(42)

In [12]:
A = pd.DataFrame(rng.randint(0, 20, (2,2)), columns=list('AB'))
A

    A   B
0   6  19
1  14  10

In [13]:
B = pd.DataFrame(rng.randint(0, 10, (3,3)), columns=list('BAC'))
B

   B  A  C
0  7  4  6
1  9  2  6
2  7  4  3

In [14]:
A + B

      A     B   C
0  10.0  26.0 NaN
1  16.0  19.0 NaN
2   NaN   NaN NaN

In [16]:
A.add(B, fill_value=0)

      A     B    C
0  10.0  26.0  6.0
1  16.0  19.0  6.0
2   4.0   7.0  3.0

In [17]:
fill = A.stack().mean()
fill

12.25

In [18]:
A.stack()

0  A     6
   B    19
1  A    14
   B    10
dtype: int64

In [19]:
49/4

12.25

In [20]:
A = rng.randint(0, 10, (3,4))
A

array([[7, 7, 2, 5],
       [4, 1, 7, 5],
       [1, 4, 0, 9]])

In [21]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-3, -6,  5,  0],
       [-6, -3, -2,  4]])

In [22]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -3 -6  5  0
2 -6 -3 -2  4

In [23]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  0  0 -5 -2
1  3  0  6  4
2 -3  0 -4  5